🚀&nbsp; env0 had composed a PR Plan for environment [Asaf / env0-playground simple-tf (env_0_playground_simple_tf)](https://app.env0.com/p/8cc99f17-388c-47f8-b558-eeba46d667df/environments/ef24544e-8cab-4ba0-bc86-be218afd0f44):
```
Plan: 1 to add, 0 to change, 1 to destroy.
```
<details>
<summary>Plan Details</summary>

```diff
OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

OpenTofu will perform the following actions:

  # random_string.random must be replaced
-/+ resource "random_string" "random" {
!       id          = "IrovB" -> (known after apply)
!       length      = 5 -> 10 # forces replacement
!       result      = "IrovB" -> (known after apply)
!       special     = false -> true # forces replacement
        # (8 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
!   random_string = "IrovB" -> (known after apply)
```
</details>


```
Failed to calculate cost estimation
```

To *apply* this plan, use the following comment:
```
env0 apply -e env_0_playground_simple_tf
```


[Full PR Plan logs on env0](https://app.env0.com/p/8cc99f17-388c-47f8-b558-eeba46d667df/environments/ef24544e-8cab-4ba0-bc86-be218afd0f44/deployments/13942db4-69e5-423d-bcfd-03eb79c86099)